// data/Tahfeez.ts
export const Tahfeez = [
	// ==================== أحاديث نبوية ====================
	{
		id: '1',
		description: 'احرص على ما ينفعك، واستعن بالله ولا تعجز.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '2',
		description: 'إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '3',
		description: 'المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '4',
		description: 'إذا سألتم الله فاسألوه الفردوس الأعلى.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '5',
		description:
			'من سلك طريقًا يلتمس فيه علمًا سهل الله له به طريقًا إلى الجنة.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '6',
		description: 'ما نقص مال من صدقة، وما زاد الله عبدًا بعفو إلا عزًا.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '7',
		description: 'احفظ الله يحفظك، احفظ الله تجده تجاهك.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '8',
		description: 'من حسن إسلام المرء تركه ما لا يعنيه.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '9',
		description: 'إن الله يحب إذا عمل أحدكم عملاً أن يتقنه.',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '10',
		description: 'المسلم من سلم المسلمون من لسانه ويده.',
		speaker: 'النبي محمد ﷺ',
	},

	// ==================== أقوال الصحابة ====================
	{
		id: '11',
		description:
			'اعلم أنكم لا تُنصرون بعددكم، ولا بقوتكم، ولكن تُنصرون بطاعتكم لله وعدل قائدكم.',
		speaker: 'عمر بن الخطاب رضي الله عنه',
	},
	{
		id: '50',
		description: 'من نافسك في دينك فنافسه، ومن نافسك في دنياك فألقها في نحره.',
		speaker: 'الحسن البصري',
	},
	{
		id: '12',
		description: 'أحبُّ الأعمال إلى الله أدومها وإن قلَّ.',
		speaker: 'عائشة رضي الله عنها',
	},
	{
		id: '13',
		description: 'ما ندمت على سكوتي قط، أما ندمي على الكلام فكثير.',
		speaker: 'علي بن أبي طالب رضي الله عنه',
	},
	{
		id: '14',
		description: 'من أكثر من شيء عُرف به.',
		speaker: 'عبد الله بن مسعود رضي الله عنه',
	},
	{
		id: '15',
		description: 'خيركم من تعلم القرآن وعلمه.',
		speaker: 'عثمان بن عفان رضي الله عنه',
	},
	{
		id: '16',
		description: 'رحم الله امرأ أهدى إليّ عيوبي.',
		speaker: 'عمر بن الخطاب رضي الله عنه',
	},
	{
		id: '41',
		description:
			'نحن قوم أعزنا الله بالإسلام، فإن ابتغينا العزة بغيره أذلنا الله',
		speaker: 'عمر بن الخطاب رضي الله عنه',
	},
	{
		id: '17',
		description:
			'ألا إن الدنيا دار عمل لا دار جزاء، والآخرة دار جزاء لا دار عمل.',
		speaker: 'علي بن أبي طالب رضي الله عنه',
	},
	{
		id: '42',
		description: 'لا تستوحشوا طريق الحق لقلة سالكيه.',
		speaker: 'علي بن أبي طالب رضي الله عنه',
	},
	{
		id: '18',
		description: 'ما أسرَّ عبدٌ سريرة إلا أظهرها الله على صفحات وجهه.',
		speaker: 'عثمان بن عفان رضي الله عنه',
	},
	{
		id: '19',
		description: 'أفضل الجهاد كلمة عدل عند سلطان جائر.',
		speaker: 'أبو بكر الصديق رضي الله عنه',
	},
	{
		id: '20',
		description:
			'العقل هو ما تمكّن به الرجل من إصلاح دنياه، والدين ما تمكّن به من إصلاح آخرته، ومن لم يكن له عقل ولا دين، فليست له حياة.',
		speaker: 'عمرو بن العاص رضي الله عنه',
	},
	{
		id: '48',
		description: 'لا يُرهبنا عدو، ولا يُغلبنا خوف، إنما نحن سيوفٌ لا تغمد.',
		speaker: ' الظاهر بيبرس',
	},
	{
		id: '49',
		description: 'لأن أموت واقفًا خير لي من أن أعيش راكعًا.',
		speaker: 'عبد الكريم الخطابي',
	},

	// ==================== أقوال القادة المسلمين ====================
	{
		id: '21',
		description: 'اطلبوا الموت توهب لكم الحياة.',
		speaker: 'خالد بن الوليد رضي الله عنه',
	},
	{
		id: '43',
		description:
			'لقد شهدت مئة زحف، وما في جسدي موضع إلا وفيه ضربة بسيف أو طعنة برمح، وها أنا أموت على فراشي كما يموت البعير، فلا نامت أعين الجبناء.',
		speaker: 'خالد بن الوليد رضي الله عنه',
	},
	{
		id: '47',
		description:
			'ما ليلة يهدي إليّ فيها عرسي أحب إليّ من ليلة شديدة الجليد، في سرية من المهاجرين، أصبح بها أعدو على الكفار.',
		speaker: 'خالد بن الوليد رضي الله عنه',
	},
	{
		id: '22',
		description: 'إن المعارك يكسبها الإيمان أكثر من العدد.',
		speaker: 'طارق بن زياد رحمه الله',
	},
	{
		id: '23',
		description: 'لا نزال أعزَّة ما أطعنا الله ورسوله.',
		speaker: 'سعد بن أبي وقاص رضي الله عنه',
	},
	{
		id: '24',
		description: 'ما أهون الموت في سبيل الله!',
		speaker: 'صلاح الدين الأيوبي رحمه الله',
	},
	{
		id: '44',
		description: 'كيف ينام الإنسان ملء عينيه والمسجد الأقصى أسير؟',
		speaker: 'صلاح الدين الأيوبي رحمه الله',
	},
	{
		id: '25',
		description: 'العدوّ إذا علم أن لك قلبًا كالحديد أذعن لك.',
		speaker: 'عماد الدين زنكي رحمه الله',
	},
	{
		id: '26',
		description: 'الرباط في سبيل الله أبلغ من الدنيا وما فيها.',
		speaker: 'نور الدين زنكي رحمه الله',
	},
	{
		id: '46',
		description: 'إني لأستحيي من الله أن أبتسم والمسجد الأقصى أسير.',
		speaker: 'نور الدين زنكي رحمه الله',
	},
	{
		id: '27',
		description: 'ما استطعتم من قوة، وأعدوا لهم ما استطعتم.',
		speaker: 'سيف الدين قطز رحمه الله',
	},
	{
		id: '28',
		description: 'من طلب الشهادة صادقًا بُلّغها ولو على فراشه.',
		speaker: 'سيف الدين قطز رحمه الله',
	},
	{
		id: '29',
		description: 'النصر صبر ساعة، والصبر سلاح المؤمن.',
		speaker: 'يوسف بن تاشفين رحمه الله',
	},
	{
		id: '30',
		description: 'الرجال الذين لا يترددون هم من يصنعون النصر.',
		speaker: 'محمد الفاتح رحمه الله',
	},
	{
		id: '45',
		description: 'لو كنتُ أعلم أن في قعر البحر خيرًا للإسلام، لخضته بفرسي.',
		speaker: 'محمد الفاتح رحمه الله',
	},
	{
		id: '31',
		description:
			' ما أكل أحد طعامًا قط خيرًا من أن يأكل من عمل يده وإن نبي الله داود عليه السلام كان يأكل من عمل يده',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '32',
		description:
			'لَأَنْ يأخذَ أحدكم حَبْلَهُ، فيَأْتِي بحِزْمَةِ الحطبِ على ظهرِهِ فيَبيعها، فيَكُفَّ اللهُ بها وجهَهُ، خيرٌ لهُ من أن يسألَ الناسَ، أعطوهُ أو منعوهُ',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '33',
		description: 'كُلُّكُم راعٍ وكُلُّكُم مسؤولٌ عن رعيتهِ',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '34',
		description:
			'ما مِن مُسْلِمٍ يَغْرِسُ غَرْسًا، أَوْ يَزْرَعُ زَرْعًا، فَيَأْكُلُ منه طَيْرٌ أَوْ إِنْسَانٌ أَوْ بَهِيمَةٌ، إِلَّا كانَ له به صَدَقَةٌ',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '35',
		description:
			'اليدُ العليا خيرٌ من اليدِ السُّفلَى واليدُ العليا المُنفِقةُ والسُّفلَى السَّائلةُ',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '36',
		description:
			'رَحِمَ اللَّهُ رَجُلاً سَمْحًا إِذَا بَاعَ، وَإِذَا اشْتَرَى، وَإِذَا اقْتَضَى',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '37',
		description:
			'سلُوا اللهَ علمًا نافعًا، وتَعَوَّذُوا باللهِ منْ علمٍ لا ينفعُ',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '38',
		description:
			'إِذَا مَاتَ الإنْسَانُ انْقَطَعَ عنْه عَمَلُهُ إِلَّا مِن ثَلَاثَةٍ: إِلَّا مِن صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو له',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '39',
		description:
			'لا حسَدَ إلَّا في اثنتيْنِ: رجلٌ آتاهُ اللهُ مالًا، فسلَّطَهُ على هلَكتِه في الحقِّ، ورجلٌ آتاهُ اللهُ الحِكمةَ، فهوَ يقضِي بِها، ويُعلِّمُها',
		speaker: 'النبي محمد ﷺ',
	},
	{
		id: '40',
		description:
			'أن رجلاً قال للنبي صلى الله عليه وسلم: أوصني، قال: لا تغضب فردد مراراً، قال: لا تغضب',
		speaker: 'النبي محمد ﷺ',
	},
];
